{
  "items": [
    {
      "id": "test-001",
      "quote": "Alexandra found us our dream home in Scarsdale in under three weeks — in what everyone told us was an impossible market. She knew about a property before it hit the MLS and got us in for a private showing the same day. We closed above asking with no drama. She's simply the best.",
      "author": "Michael & Jennifer T.",
      "title": "Buyers, Scarsdale",
      "category": "buyers",
      "transactionType": "Purchased 4BR colonial",
      "rating": 5,
      "featured": true,
      "date": "2025-11-15"
    },
    {
      "id": "test-002",
      "quote": "I've sold three homes over the past 20 years and worked with a handful of different agents. Alexandra is in a different league. Her pricing instinct is exceptional — we listed at exactly the right number and had 11 offers in the first weekend. We sold for $85,000 over asking.",
      "author": "Robert S.",
      "title": "Seller, Larchmont",
      "category": "sellers",
      "transactionType": "Sold 5BR waterfront home",
      "rating": 5,
      "featured": true,
      "date": "2025-10-02"
    },
    {
      "id": "test-003",
      "quote": "We needed to sell quickly due to a job relocation, and Alexandra made what could have been a nightmare into a smooth, confidence-inspiring process. She had us under contract in 8 days at exactly her projected price. The valuation she gave us upfront turned out to be dead accurate.",
      "author": "Caroline M.",
      "title": "Seller, Bronxville",
      "category": "sellers",
      "transactionType": "Sold townhouse — relocation",
      "rating": 5,
      "featured": false,
      "date": "2025-09-18"
    },
    {
      "id": "test-004",
      "quote": "As first-time buyers, we were intimidated by the Westchester market. Alexandra was endlessly patient, deeply knowledgeable, and never made us feel pressured. She educated us at every step and helped us write an offer that won in a 7-offer situation without being the highest price. We're still grateful.",
      "author": "David & Amy K.",
      "title": "First-Time Buyers, White Plains",
      "category": "buyers",
      "transactionType": "Purchased 2BR condo",
      "rating": 5,
      "featured": false,
      "date": "2025-08-30"
    },
    {
      "id": "test-005",
      "quote": "Alexandra handled our investment property search with the analytical rigor of a financial advisor and the market knowledge of a true local expert. She identified three properties I wouldn't have found on my own, modeled the cash flows accurately, and negotiated a price that made the numbers work. Highly recommend for investors.",
      "author": "James L.",
      "title": "Investor, Mamaroneck",
      "category": "investors",
      "transactionType": "Purchased multi-family investment property",
      "rating": 5,
      "featured": true,
      "date": "2025-07-12"
    },
    {
      "id": "test-006",
      "quote": "We were relocating from San Francisco and needed someone who could manage our Westchester home search remotely. Alexandra organized video tours, answered questions at all hours, and made us feel completely informed despite being 3,000 miles away. By the time we flew in to see properties in person, we knew exactly what we wanted.",
      "author": "Thomas & Sarah W.",
      "title": "Relocation Buyers, Rye",
      "category": "buyers",
      "transactionType": "Purchased 4BR colonial — relocation from SF",
      "rating": 5,
      "featured": false,
      "date": "2025-06-20"
    },
    {
      "id": "test-007",
      "quote": "Alexandra leased my commercial property in Mamaroneck within 6 weeks after it had sat vacant with another broker for 4 months. Her network and marketing approach made the difference. The tenant she placed has been excellent.",
      "author": "Patricia O.",
      "title": "Commercial Landlord, Mamaroneck",
      "category": "commercial",
      "transactionType": "Commercial lease — office space",
      "rating": 4,
      "featured": false,
      "date": "2025-05-08"
    },
    {
      "id": "test-008",
      "quote": "Three words: pick up the phone. I've worked with agents who disappear for days. Alexandra responded to every text and email within an hour, sometimes within minutes. In a fast-moving market, that responsiveness is worth money.",
      "author": "Mark & Lisa R.",
      "title": "Buyers, Scarsdale",
      "category": "buyers",
      "transactionType": "Purchased 3BR colonial",
      "rating": 5,
      "featured": false,
      "date": "2025-04-22"
    },
    {
      "id": "test-009",
      "quote": "We rented in Larchmont before we were ready to buy, and Alexandra helped us find a beautiful rental that put us in the right neighborhood while we saved for a down payment. A year later, she helped us buy our first home. She played the long game with us and we'll be loyal clients for life.",
      "author": "Jason C.",
      "title": "Renter then Buyer, Larchmont",
      "category": "renters",
      "transactionType": "Rental placement then home purchase",
      "rating": 5,
      "featured": false,
      "date": "2025-03-15"
    },
    {
      "id": "test-010",
      "quote": "I was skeptical that any agent could add real value in this market — I thought I could find the property myself online. I was wrong. Alexandra showed me off-market properties I had no access to, identified structural issues I missed in two of them, and negotiated $45,000 off the price on the home I ultimately bought. Worth every penny of her commission.",
      "author": "Andrew B.",
      "title": "Buyer, Bronxville",
      "category": "buyers",
      "transactionType": "Purchased 4BR colonial",
      "rating": 5,
      "featured": false,
      "date": "2025-02-08"
    }
  ]
}